// Задача 1:
//          Напишите цикл, который принимает на вход два числа (A и B) и 
//          возводит число A в натуральную степень B.
//          3, 5 -> 243 (3⁵)
//          2, 4 -> 16


/*
int AtoB(int a, int b)
{
    int result = 1;
    for (int i = 1; i <= b; i++)
        result *= a;
    return result;
}
Console.WriteLine(" Imput two numbers:");
int a = Convert.ToInt32(Console.ReadLine());
int b = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"I will raise {a} to the power of {b}");
Console.WriteLine(AtoB(a,b));
// double atob = Math.Pow(a,b);
// Console.WriteLine(atob);
*/



// Задача 27: Напишите программу, которая принимает на вход число и выдаёт
//            сумму цифр в числе.
//            452 -> 11
//            82 -> 10
//            9012 -> 12
